In [2]:
import pandas as pd, os
import numpy as np

DIR = '../../Data/'
FILE = DIR+'titanic.csv'

In [4]:
titaDF = pd.read_csv(FILE)
titaDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
titaDF.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
titaDF['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [23]:
subtitaDF = titaDF[['Age','Fare']].head(5)

In [24]:
subtitaDF['Value']=10
subtitaDF

    Age     Fare  Value
0  22.0   7.2500     10
1  38.0  71.2833     10
2  26.0   7.9250     10
3  35.0  53.1000     10
4  35.0   8.0500     10

### apply(함수명, axis=방향/축) 실습 ------------------

- 원소/요소에 함수 적용하기

- 입력 : Series의 요소 또는 DataFrame의 Series 즉, 행 또는 열

In [25]:
# [기본] axis = 0 ----- row의 컬럼마다 함수 적용
subtitaDF.apply(np.sum)

Age      156.0000
Fare     147.6083
Value     50.0000
dtype: float64

In [26]:
# [기본] axis = 0 ----- row의 컬럼마다 함수 적용
subtitaDF.apply(np.sum, axis=1)

0     39.2500
1    119.2833
2     43.9250
3     98.1000
4     53.0500
dtype: float64

In [27]:
# 사용자 정의 함수 ----------------------------------
def addValue(x):
    print(f'[DEBUG]----------\n {x}')
    return x+x

def addTwoValue(x,y):
    print(f'[DEBUG]----------\n {x}, {y}')
    return x+y

In [28]:
subtitaDF.apply(addValue)

[DEBUG]----------
 0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64
[DEBUG]----------
 0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64
[DEBUG]----------
 0    10
1    10
2    10
3    10
4    10
Name: Value, dtype: int64

    Age      Fare  Value
0  44.0   14.5000     20
1  76.0  142.5666     20
2  52.0   15.8500     20
3  70.0  106.2000     20
4  70.0   16.1000     20

In [29]:
subtitaDF.apply(addValue, axis=1)

[DEBUG]----------
 Age      22.00
Fare      7.25
Value    10.00
Name: 0, dtype: float64
[DEBUG]----------
 Age      38.0000
Fare     71.2833
Value    10.0000
Name: 1, dtype: float64
[DEBUG]----------
 Age      26.000
Fare      7.925
Value    10.000
Name: 2, dtype: float64
[DEBUG]----------
 Age      35.0
Fare     53.1
Value    10.0
Name: 3, dtype: float64
[DEBUG]----------
 Age      35.00
Fare      8.05
Value    10.00
Name: 4, dtype: float64

    Age      Fare  Value
0  44.0   14.5000   20.0
1  76.0  142.5666   20.0
2  52.0   15.8500   20.0
3  70.0  106.2000   20.0
4  70.0   16.1000   20.0

In [30]:
subtitaDF['Age'].apply(addValue)

[DEBUG]----------
 22.0
[DEBUG]----------
 38.0
[DEBUG]----------
 26.0
[DEBUG]----------
 35.0
[DEBUG]----------
 35.0

0    44.0
1    76.0
2    52.0
3    70.0
4    70.0
Name: Age, dtype: float64

In [31]:
subtitaDF.apply(addTwoValue, y=2000)

[DEBUG]----------
 0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64, 2000
[DEBUG]----------
 0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64, 2000
[DEBUG]----------
 0    10
1    10
2    10
3    10
4    10
Name: Value, dtype: int64, 2000

      Age       Fare  Value
0  2022.0  2007.2500   2010
1  2038.0  2071.2833   2010
2  2026.0  2007.9250   2010
3  2035.0  2053.1000   2010
4  2035.0  2008.0500   2010

In [32]:
# 사용자 정의 함수 ---------------------------------
def missingValueCheck(sr):
    return sr.isnull()